package texting

// todo: remove after localize.

const (
	InternalAIImageMessage    = "Опиши что изображено на картинке. Обязательно попытайся ответить."
	InternalAIAudioMessage    = "Транскрибируй аудио файл максимально точно."
	InternalAIAudioPrompt     = "Текст для обработки"
)

const (
	MsgXiError          = "🤕 Императорская телеграмма не смогла пройти сквозь Великую Китайскую стену."

	MsgDailyLimitExceeded   = "🈲 Ваш дневной социальный рейтинг исчерпан. Аудиенция у императора возобновится завтра."
	MsgMonthlyLimitExceeded = "🈲 Вы превысили месячный лимит на использование этой функции."
	MsgInsufficientCredits  = "💢 Казна императора опустела! Без вашей поддержки (от $15/мес) Великий Xi не сможет продолжать служить народу. Пополнить казну: @MairwunNx."
)

const (
	MsgSpendingLimitExceededDialer   = "\n\n>⚠️ Превышен **%s** лимит **%s** тарифа (потрачено **%s** из **%s**). Использована упрощенная модель 🤧. Для расширения лимита свяжитесь с @MairwunNx."
	MsgSpendingLimitExceededVision  = "\n\n>⚠️ Превышен **%s** лимит **%s** тарифа (потрачено **%s** из **%s**). Использована упрощенная модель для анализа изображения 🤧. Для расширения лимита свяжитесь с @MairwunNx."
	MsgSpendingLimitExceededDaily   = "суточный"
	MsgSpendingLimitExceededMonthly = "месячный"
)